Merge pull request #1 from SonnyCastro/refactor
Refactor: Implement Context API, improve animations, and document arc…
